<script setup lang="ts">
  const items = [
    {
      label: 'Τι είναι η υπηρεσία "Γιατρός Κοντά Σας";',
      defaultOpen: true,
      content:
        'Η υπηρεσία "Γιατρός Κοντά Σας" προσφέρει ιατρικές επισκέψεις κατ οίκον, παρέχοντας άμεση και ποιοτική φροντίδα στο χώρο σας, χωρίς την ανάγκη μετακίνησης σε ιατρεία ή νοσοκομεία.',
    },
    {
      label: "Πώς μπορώ να κλείσω ραντεβού;",
      content:
        "Προς το παρόν, μπορείτε να συμπληρώσετε τη φόρμα εκδήλωσης ενδιαφέροντος που θα βρείτε στην ιστοσελίδα μας. Θα σας ενημερώσουμε άμεσα μόλις ξεκινήσουν οι υπηρεσίες μας. Στην αρχική φάση, θα επιλεγούν συγκεκριμένα άτομα που θα έχουν την ευκαιρία να χρησιμοποιήσουν πρώτοι τις υπηρεσίες μας, εξασφαλίζοντας υψηλή ποιότητα εξυπηρέτησης.",
    },
    {
      label: "Πόσο σύντομα μπορεί να γίνει η επίσκεψη στο σπίτι μου;",
      content:
        "Οι γιατροί μας μπορούν να σας επισκεφθούν εντός λίγων ωρών από την κράτηση, ανάλογα με τη διαθεσιμότητα και την περιοχή σας.",
    },
    {
      label: "Τι πρέπει να έχω έτοιμο πριν την επίσκεψη του γιατρού;",
      content:
        "Συνιστάται να έχετε έτοιμο το ιατρικό σας ιστορικό, τυχόν εξετάσεις και λίστα φαρμάκων που λαμβάνετε για διευκόλυνση της διαδικασίας.",
    },
    {
      label: "Μπορώ να προγραμματίσω επαναλαμβανόμενες επισκέψεις;",
      content:
        "Ναι, υπάρχει η δυνατότητα να προγραμματίσετε επαναλαμβανόμενα ραντεβού για τη συνεχή παρακολούθηση της υγείας σας.",
    },
  ];
</script>

<template>
  <div>
    <section class="mb-3 mx-auto container !max-w-3xl py-16">
      <h2 class="text-4xl font-bold mb-8 text-center">Συχνές ερωτήσεις</h2>
      <UAccordion
        :items="items"
        :ui="{
          header: {
            base: 'text-xl font-semibold text-neutral-950',
          },
        }"
      />
    </section>
  </div>
</template>
